; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image1 - mode
	thermograph0 - mode
	infrared2 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation12 - direction
	GroundStation13 - direction
	Star0 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
)
(:goal (and
	(pointing satellite0 GroundStation9)
	(have_image Planet14 image1)
	(have_image Star15 image1)
	(have_image Star16 infrared2)
	(have_image Planet17 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation9)
   goals met: 1 of 5
3. (turn_to satellite0 star0 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star0)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite0 groundstation9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation9)
   goals met: 1 of 5
6. (turn_to satellite0 planet14 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 planet14)
   goals met: 0 of 5
7. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 1 of 5
8. (turn_to satellite0 groundstation9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation9)
   goals met: 2 of 5
9. (turn_to satellite0 planet17 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 planet17)
   goals met: 1 of 5
10. (take_image satellite0 planet17 instrument0 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 2 of 5
11. (turn_to satellite0 groundstation9 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 groundstation9)
   goals met: 3 of 5
12. (turn_to satellite0 star15 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star15)
   goals met: 2 of 5
13. (take_image satellite0 star15 instrument0 image1)
   added: (have_image star15 image1)
   goals met: 3 of 5
14. (turn_to satellite0 groundstation9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 groundstation9)
   goals met: 4 of 5
15. (turn_to satellite0 star16 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 star16)
   goals met: 3 of 5
16. (take_image satellite0 star16 instrument0 infrared2)
   added: (have_image star16 infrared2)
   goals met: 4 of 5
17. (turn_to satellite0 groundstation9 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation9)
   goals met: 5 of 5
